databaseconcept.org
#+LATEX_HEADER: \usepackage{amssymb}
* Chap1
** Taught
1-8, 10, 11-16, 22-23
** DBMS(database management system)
*** collection of interrelated data
** DBMS solution
*** Commercial/freeware DBMS
*** Application programs
** View of data
*** Levels of Abstraction
**** physical level
    how the data are stored
**** logical level
    relations among the data
**** view level
*** Instances(实例) and schemas(模式)
    + instance :: the collection of information stored in the
                  database at a particular moment
    + schema :: the overal design of the database
*** Data module
**** a collections of tools for describing
     1. Data
     2. Data relationships
     3. Data semantics
     4. Data constraints
** Relational database
*** Relational model
    | ID | name | Dept_name | Salary |
    | 22 |  112 |       131 |  13131 |
*** Data definition language(DDL)
    create table instructor (
    ID char(5),
    name varchar(5)
    )
    - DDL compiler :: generates a set of table templates
                      stored in a data dictionary
    - Data dictionary :: contains metadata
*** Data manipulation language(DML)
    Also known as query language(查询语言)
    Types of access are
    - Procedural :: user specifyies what data is required
                    and how to get the data
    - Declarative(nonprocedural) :: require a user to specify
                                    what data are needed without
                                    specifying how to get those data
    - query :: a statement requesting the retrieval of information
** SQL
*** Example
      Find the name of the instructor with ID 5
      select name
      from instructor
      where instructor.ID = '5'
*** Database design
#+TITLE:
* Chap2
** Structure of relational databases
   - domain :: the set of permitted values of each attribute
   - atomic :: a domain is atomic if elements of the
               domain are considered to be indivisible units
   - null :: a null value is a special value that signifies that
             the value is unknown or does not exist
** Database schema
   - database schema :: logical design of the database
   - database instance :: snapshot of the data in the database
                          at a given instant in time
   - relation schema :: consists of a list of attributs and their
                        conrresponding domains
     + A₁,..,Aₙ are attributes
     + R = (A₁,...,Aₙ) is a relation schema
       e.g. instructor_schema = (ID, name, dept_name)
     + r(R) denotes a relation r on the relation schema
       e.g. instructor(instructor_schema)
     + fiven sets D₁,...,Dₙ, a relation r is a subset of
       D₁×D₂...×Dₙ
       Thus a relation is a set of n-tuples (a₁,...,aₙ) where each
       aᵢ∈Dᵢ
     + The current values (relation instance) of a relation are specified
       by a table
     + An element t of r is a tuple, represented by a row in a table

   - relation instance :: corresponds to the programming language notion
                          of a value of a varia
** Keys
   Let K ⊆ R
   - superkey :: K is a superkey of R if values for K are suffient to
                 identify a unique tuple of each possible relation r(R)
   - {ID} and {ID, name} are both superkeys of instrctor
   - candidate key :: s superkey K is minimal
   - {ID} is minimal
   - primary key :: one of the candidate key is chosen primary key
   - foreign key :: A relatoin schema may have an attribute that
                    corresponds to the primary key of another relation.
                    The attribute is called a foreign key
** Relational query language
*** procedural, non-procedural, or declarative
*** "Pure" language
    + relational algebra
    + tuple relational calculus
    + domain relational calculus
*** relational algebra
    + procedural language
    + six basic operators
      + selection: σ
      + projection: Π
      + union: ∪
      + natural join: ⋈ //SHEN MI
      + set different: -
      + cartesian product: ×
* DONE
  Ex 1.8, 1.9, 1.13, 1.15, 2.9, 2.13
Consider the bank database of Figure 2.15.
a. What are the appropriate primary keys?
b. Given your choice of primary keys, identify appropriate foreign keys.

branch(branch name, branch city, assets)
customer (customer name, customer street, customer city)
loan (loan number, branch name, amount)
borrower (customer name, loan number)
account (account number, branch name, balance)
depositor (customer name, account number)

Consider the bank database of Figure 2.15. Give an expression in the relational
algebra for each of the following queries:
a. Find all loan numbers with a loan value greater than $10,000.
b. Find the names of all depositors who have an account with a value
greater than $6,000.
c. Find the names of all depositors who have an account with a value
greater than $6,000 at the “Uptown” branch
#+TITLE:WEEK2
* Chap6
** Relational Algebra
*** selection operation
    + notation: σ_ρ(r)
    + selection predicate :: ρ
    + σ_ρ(r) = {t | t ∈ r and p(t)}
    + ∧ :: and
    + ∨ :: or
*** project operation
*** union operation
    must have the same arity
    the attribute domains must be compatible
*** set difference operation
    have same arity
    attribute domains must be compatible
*** Cartesian product operation
    + r × s = {t q | t ∈ r *and* q ∈ s}
    + assume that r(R) and s(S) are disjoint
    + If not disjoint, then *renaming* must be used
*** rename operation
    ρₓ(E)
    if E has arity n, then
    ρₓ₍ₐ₁,...,ₐₙ₎(E)
