databaseconcept.tex
% Created 2018-05-21 一 14:30
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{pst-plot}
\usepackage{color}
\usepackage{listings}
\usepackage{amssymb}
\author{wu}
\date{\today}
\title{ WEEK2}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.3.50.2 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{Chap1}
\label{sec-1}
\subsection{Taught}
\label{sec-1-1}
1-8, 10, 11-16, 22-23
\subsection{DBMS(database management system)}
\label{sec-1-2}
\subsubsection{collection of interrelated data}
\label{sec-1-2-1}
\subsection{DBMS solution}
\label{sec-1-3}
\subsubsection{Commercial/freeware DBMS}
\label{sec-1-3-1}
\subsubsection{Application programs}
\label{sec-1-3-2}
\subsection{View of data}
\label{sec-1-4}
\subsubsection{Levels of Abstraction}
\label{sec-1-4-1}
\begin{enumerate}
\item physical level
\label{sec-1-4-1-1}
how the data are stored
\item logical level
\label{sec-1-4-1-2}
relations among the data
\item view level
\label{sec-1-4-1-3}
\end{enumerate}
\subsubsection{Instances(实例) and schemas(模式)}
\label{sec-1-4-2}
\begin{description}
\item[{instance}] the collection of information stored in the
database at a particular moment
\item[{schema}] the overal design of the database
\end{description}
\subsubsection{Data module}
\label{sec-1-4-3}
\begin{enumerate}
\item a collections of tools for describing
\label{sec-1-4-3-1}
\begin{enumerate}
\item Data
\item Data relationships
\item Data semantics
\item Data constraints
\end{enumerate}
\end{enumerate}
\subsection{Relational database}
\label{sec-1-5}
\subsubsection{Relational model}
\label{sec-1-5-1}
\begin{center}
\begin{tabular}{rrrr}
ID & name & Dept$_{\text{name}}$ & Salary\\
22 & 112 & 131 & 13131\\
\end{tabular}
\end{center}
\subsubsection{Data definition language(DDL)}
\label{sec-1-5-2}
create table instructor (
ID char(5),
name varchar(5)
)
\begin{description}
\item[{DDL compiler}] generates a set of table templates
stored in a data dictionary
\item[{Data dictionary}] contains metadata
\end{description}
\subsubsection{Data manipulation language(DML)}
\label{sec-1-5-3}
Also known as query language(查询语言)
Types of access are
\begin{description}
\item[{Procedural}] user specifyies what data is required
and how to get the data
\item[{Declarative(nonprocedural)}] require a user to specify
what data are needed without
specifying how to get those data
\item[{query}] a statement requesting the retrieval of information
\end{description}
\subsection{SQL}
\label{sec-1-6}
\subsubsection{Example}
\label{sec-1-6-1}
Find the name of the instructor with ID 5
select name
from instructor
where instructor.ID = '5'
\subsubsection{Database design}
\label{sec-1-6-2}
\section{Chap2}
\label{sec-2}
\subsection{Structure of relational databases}
\label{sec-2-1}
\begin{description}
\item[{domain}] the set of permitted values of each attribute
\item[{atomic}] a domain is atomic if elements of the
domain are considered to be indivisible units
\item[{null}] a null value is a special value that signifies that
the value is unknown or does not exist
\end{description}
\subsection{Database schema}
\label{sec-2-2}
\begin{description}
\item[{database schema}] logical design of the database
\item[{database instance}] snapshot of the data in the database
at a given instant in time
\item[{relation schema}] consists of a list of attributs and their
conrresponding domains
\begin{itemize}
\item A₁,..,Aₙ are attributes
\item R = (A₁,\ldots{},Aₙ) is a relation schema
e.g. instructor$_{\text{schema}}$ = (ID, name, dept$_{\text{name}}$)
\item r(R) denotes a relation r on the relation schema
e.g. instructor(instructor$_{\text{schema}}$)
\item fiven sets D₁,\ldots{},Dₙ, a relation r is a subset of
D₁×D₂\ldots{}×Dₙ
Thus a relation is a set of n-tuples (a₁,\ldots{},aₙ) where each
aᵢ∈Dᵢ
\item The current values (relation instance) of a relation are specified
by a table
\item An element t of r is a tuple, represented by a row in a table
\end{itemize}

\item[{relation instance}] corresponds to the programming language notion
of a value of a varia
\end{description}
\subsection{Keys}
\label{sec-2-3}
Let K ⊆ R
\begin{description}
\item[{superkey}] K is a superkey of R if values for K are suffient to
identify a unique tuple of each possible relation r(R)
\item \{ID\} and \{ID, name\} are both superkeys of instrctor
\item[{candidate key}] s superkey K is minimal
\item \{ID\} is minimal
\item[{primary key}] one of the candidate key is chosen primary key
\item[{foreign key}] A relatoin schema may have an attribute that
corresponds to the primary key of another relation.
The attribute is called a foreign key
\end{description}
\subsection{Relational query language}
\label{sec-2-4}
\subsubsection{procedural, non-procedural, or declarative}
\label{sec-2-4-1}
\subsubsection{"Pure" language}
\label{sec-2-4-2}
\begin{itemize}
\item relational algebra
\item tuple relational calculus
\item domain relational calculus
\end{itemize}
\subsubsection{relational algebra}
\label{sec-2-4-3}
\begin{itemize}
\item procedural language
\item six basic operators
\begin{itemize}
\item selection: σ
\item projection: Π
\item union: ∪
\item natural join: ⋈ //SHEN MI
\item set different: -
\item cartesian product: ×
\end{itemize}
\end{itemize}
\section{{\bfseries\sffamily DONE} }
\label{sec-3}
  Ex 1.8, 1.9, 1.13, 1.15, 2.9, 2.13
Consider the bank database of Figure 2.15.
a. What are the appropriate primary keys?
b. Given your choice of primary keys, identify appropriate foreign keys.

branch(branch name, branch city, assets)
customer (customer name, customer street, customer city)
loan (loan number, branch name, amount)
borrower (customer name, loan number)
account (account number, branch name, balance)
depositor (customer name, account number)

Consider the bank database of Figure 2.15. Give an expression in the relational
algebra for each of the following queries:
a. Find all loan numbers with a loan value greater than \$10,000.
b. Find the names of all depositors who have an account with a value
greater than \$6,000.
c. Find the names of all depositors who have an account with a value
greater than \$6,000 at the “Uptown” branch
\section{Chap6}
\label{sec-4}
\subsection{Relational Algebra}
\label{sec-4-1}
\subsubsection{selection operation}
\label{sec-4-1-1}
\begin{itemize}
\item notation: σ$_{\text{ρ}}$(r)
\item[{selection predicate}] ρ
\item σ$_{\text{ρ}}$(r) = \{t | t ∈ r and p(t)\}
\item[{∧}] and
\item[{∨}] or
\end{itemize}
\subsubsection{project operation}
\label{sec-4-1-2}
\subsubsection{union operation}
\label{sec-4-1-3}
must have the same arity
the attribute domains must be compatible
\subsubsection{set difference operation}
\label{sec-4-1-4}
have same arity
attribute domains must be compatible
\subsubsection{Cartesian product operation}
\label{sec-4-1-5}
\begin{itemize}
\item r × s = \{t q | t ∈ r \textbf{and} q ∈ s\}
\item assume that r(R) and s(S) are disjoint
\item If not disjoint, then \textbf{renaming} must be used
\end{itemize}
\subsubsection{rename operation}
\label{sec-4-1-6}
ρₓ(E)
if E has arity n, then
ρₓ₍ₐ₁,\ldots{},ₐₙ₎(E)
