databaseconcept.org
*** Additional operations
    + set intersection ::
         r ∩ s = r - (r - s)
    + natural join :: (bowtie)
                     r ⋈ s
                     R = (A,B,C,D) S = (B, E, D) R ⋈ S = (A, B, C, D, E)
                     Cartesian product is renaming
                     projection of renaming of Cartesian product
                     natural join is associative and commutative
    + theta join ::
                   r ⋈θ s
    + equijoin ::
    + semijoin ::
                 often used to compute natural joins in distributed databases
    + assignment ::
                   ←
    + outer join ::
      + extension of join operation avoids loss of information
      + use *null* values:
        *null* signifies the value is unknown or doesn't exist
        instructor
        | ID | name | dept_name |
        |  1 | A    | Comp      |
        |  2 | B    | Finance   |
        |  3 | C    | Miao      |
        teaches
        | ID | course_id |
        |  1 | CS-101    |
        |  2 | FIN-201   |
        |  4 | BIO-201   |
        left outer_join:
        | ID | name | dept_name | course_id |
        |  1 | A    | Comp      | CS-101    |
        |  2 | B    | Finance   | FIN-201   |
        |  3 | C    | Miao      | *null*    |
        right outer join
        | ID | name   | dept_name | course_id |
        |  1 | A      | Comp      | CS-101    |
        |  2 | B      | Finance   | FIN-201   |
        |  4 | *null* | *null*    | BIO-201   |
        full outer join
        | ID | name   | dept_name | course_id |
        |  1 | A      | Comp      | CS-101    |
        |  2 | B      | Finance   | FIN-201   |
        |  3 | C      | Miao      | *null*    |
        |  4 | *null* | *null*    | BIO-201   |
    + null values ::
                    three-ordered logic
                      | or\and | null | true | false |
                      | null   | null | null | null  |
                      | true   | null |      |       |
                      | false  | null |      |       |
    + division operator ::
         given relations r(R) and s(S) s.t. S
*** Logical equivalence of RA plans
    + σₐ₌₅(Πₐ(R)) = Πₐ(σₐ₌₅(R))
** extend relational algebra operations
*** generalized projection
    + extends the projection operation by allowing arithmetic functions to be
      used in the projection list
*** Aggregate functions and operations
*** Multiset relational algebra
* DONE
  6.1 6.13
Write the following queries in relational algebra, using the university
schema.
a. Find the titles of courses in the Comp. Sci. department that have 3
credits.
b. Find the IDs of all students who were taught by an instructor named
Einstein; make sure there are no duplicates in the result.
c. Find the highest salary of any instructor.
d. Find all instructors earning the highest salary (there may be more
e. Find the enrollment of each section that was offered in Autumn 2009.
f. Find the maximum enrollment, across all sections, in Autumn 2009.
g. Find the sections that had the maximum enrollment in Autumn 2009.


employee (person name, street, city )
works (person name, company name, salary)
company (company name, city)
manages (person name, manager name)
Consider the relational database of Figure 6.22. Give a relational-algebra
expression for each of the following queries:
a. Find the company with the most employees.
b. Find the company with the smallest payroll.
c. Find those companies whose employees earn a higher salary, on average, than
the average salary at First Bank Corporation.
* Chap3
** SQL data definition
*** Basic types
    char(n): fixed length
    varchar(n): variable-length
*** Basic schema definition: table
*** update to table
    + insert ::
    + delete ::
    + drop table ::
    + alter ::
              change the structure of the table
      + *alter table r add A D*
        where A is the name of the attribute to be added to relation
        r and D is the domain of A
      + *alter table r drop A*
        A is the name of an attribute

** Foreign key and primary key
   foreign keys are constraints
