databaseconcept.tex
\subsubsection{Additional operations}
\label{sec-4-1-7}
\begin{description}
\item[{set intersection}] r ∩ s = r - (r - s)
\item[{natural join}] (bowtie)
r ⋈ s
R = (A,B,C,D) S = (B, E, D) R ⋈ S = (A, B, C, D, E)
Cartesian product is renaming
projection of renaming of Cartesian product
natural join is associative and commutative
\item[{theta join}] r ⋈θ s
\item[{equijoin}] 
\item[{semijoin}] often used to compute natural joins in distributed databases
\item[{assignment}] ←
\item[{outer join}] \begin{itemize}
\item extension of join operation avoids loss of information
\item use \textbf{null} values:
\textbf{null} signifies the value is unknown or doesn't exist
instructor
\begin{center}
\begin{tabular}{rll}
ID & name & dept$_{\text{name}}$\\
1 & A & Comp\\
2 & B & Finance\\
3 & C & Miao\\
\end{tabular}
\end{center}
teaches
\begin{center}
\begin{tabular}{rl}
ID & course$_{\text{id}}$\\
1 & CS-101\\
2 & FIN-201\\
4 & BIO-201\\
\end{tabular}
\end{center}
left outer$_{\text{join}}$:
\begin{center}
\begin{tabular}{rlll}
ID & name & dept$_{\text{name}}$ & course$_{\text{id}}$\\
1 & A & Comp & CS-101\\
2 & B & Finance & FIN-201\\
3 & C & Miao & \textbf{null}\\
\end{tabular}
\end{center}
right outer join
\begin{center}
\begin{tabular}{rlll}
ID & name & dept$_{\text{name}}$ & course$_{\text{id}}$\\
1 & A & Comp & CS-101\\
2 & B & Finance & FIN-201\\
4 & \textbf{null} & \textbf{null} & BIO-201\\
\end{tabular}
\end{center}
full outer join
\begin{center}
\begin{tabular}{rlll}
ID & name & dept$_{\text{name}}$ & course$_{\text{id}}$\\
1 & A & Comp & CS-101\\
2 & B & Finance & FIN-201\\
3 & C & Miao & \textbf{null}\\
4 & \textbf{null} & \textbf{null} & BIO-201\\
\end{tabular}
\end{center}
\end{itemize}
\item[{null values}] three-ordered logic
\begin{center}
\begin{tabular}{llll}
or\and & null & true & false\\
null & null & null & null\\
true & null &  & \\
false & null &  & \\
\end{tabular}
\end{center}
\item[{division operator}] given relations r(R) and s(S) s.t. S
\end{description}
\subsubsection{Logical equivalence of RA plans}
\label{sec-4-1-8}
\begin{itemize}
\item σₐ₌₅(Πₐ(R)) = Πₐ(σₐ₌₅(R))
\end{itemize}
\subsection{extend relational algebra operations}
\label{sec-4-2}
\subsubsection{generalized projection}
\label{sec-4-2-1}
\begin{itemize}
\item extends the projection operation by allowing arithmetic functions to be
used in the projection list
\end{itemize}
\subsubsection{Aggregate functions and operations}
\label{sec-4-2-2}
\subsubsection{Multiset relational algebra}
\label{sec-4-2-3}
\section{{\bfseries\sffamily DONE} }
\label{sec-5}
  6.1 6.13
Write the following queries in relational algebra, using the university
schema.
a. Find the titles of courses in the Comp. Sci. department that have 3
credits.
b. Find the IDs of all students who were taught by an instructor named
Einstein; make sure there are no duplicates in the result.
c. Find the highest salary of any instructor.
d. Find all instructors earning the highest salary (there may be more
e. Find the enrollment of each section that was offered in Autumn 2009.
f. Find the maximum enrollment, across all sections, in Autumn 2009.
g. Find the sections that had the maximum enrollment in Autumn 2009.


employee (person name, street, city )
works (person name, company name, salary)
company (company name, city)
manages (person name, manager name)
Consider the relational database of Figure 6.22. Give a relational-algebra
expression for each of the following queries:
a. Find the company with the most employees.
b. Find the company with the smallest payroll.
c. Find those companies whose employees earn a higher salary, on average, than
the average salary at First Bank Corporation.
\section{Chap3}
\label{sec-6}
\subsection{SQL data definition}
\label{sec-6-1}
\subsubsection{Basic types}
\label{sec-6-1-1}
char(n): fixed length
varchar(n): variable-length
\subsubsection{Basic schema definition: table}
\label{sec-6-1-2}
\subsubsection{update to table}
\label{sec-6-1-3}
\begin{description}
\item[{insert}] 
\item[{delete}] 
\item[{drop table}] 
\item[{alter}] change the structure of the table
\begin{itemize}
\item \textbf{alter table r add A D}
where A is the name of the attribute to be added to relation
r and D is the domain of A
\item \textbf{alter table r drop A}
        A is the name of an attribute
\end{itemize}
\end{description}

\subsection{Foreign key and primary key}
\label{sec-6-2}
foreign keys are constraints
