databaseconcept.org
** Basic query structure
   + select clause ::
     + to force the elimination of duplicates, insert the keyword *distinct*
     + *all* specifies that duplicates not to be removed
     + select * denotes all attributes.
     + An attribute can be a literal with no from clause
       *select '437'*
       results is a table with one column and a single row with value "437"
     + *select 'A' from instructor
       result is a table with one column and N rows, each row with value "A"
     + Can also contain arithmetic expressions
   + where clause ::
     + Find the Cartesian product (select * from instructor, teaches)
       generates every possible *instructor-teacher* pair
       for common attribute, the attributes in the resulting table are renamed using
       the relation name
   + join ::
     + the comma in from clause
   + natural join ::
     + select * from instructor natural join teaches
   + rename operation ::
     + *as*
   + string operation ::
     + % matches any substring
     + underscore _ matches any character
     + e.g. where name like '%dar%'
     + use %: \%
     + concatenation ||
     + converting from upper to lower case
     + finding string length, extracting substring
   + ordering the display of tuples ::
     + select distinct name from instructor order by name
     + *desc* for descending order *asc* for ascending.
         e.g. order by name desc
     + can sort on multiple attributes
         e.g. order by dept_name, name
   + where clause predicates ::
     + *between*
       e.g. select name from instructor where salary between 90000 and 10000
     + tuple comparison
       $(a_1,a_2)\le(b_1,b_2)$ iff $a_1\le b_1$ and $a_2\le b_2$
   + duplicate ::
     + Multiset
   + Set operation ::
     + union, intersect, except
       each of the above operations automatically eliminates duplicates
     + to retain all duplicates, use union all, intersect all, except all
   + Null value ::
     + arithmetic expression involving null is null
     + is null can be used to check for null values
       select name from instructor where salary is null
   + Aggregate functions ::
     + avg, min, max, sum, count
     + Except count, all aggregations apply to a single attribute
     + e.g. select avg(salary) from instructor where dept_name='Comp. Sci.';
       | avg(salary) |
       | 750000      |
     + Find the number of tuples in the course relation
       select count(*) from course;
     + grouping and aggregation ::
       + e.g. select product, sum from purchase group by product
       + 1.compute the from and where clauses
         2.group by the attributes in the group
         3.Compute the select clause
     + Having clause ::
       + predicates in the *having* clause are applied after the formation of groups
         whereas predicates in the *where* clause are applied before groups
     + General form of grouping and aggregation ::
       + select S from R₁,...,Rₙ where C₁ group by a₁,...,aₙ having C₂
   + Nested subqueries ::
     + SQL provides a mechanism for the nesting of subqueries. A subquery is
       a *select-from-where* expression that is nested within another query.
   + Set membership ::
     + in :: tests for set membership
     + not in ::
   + set comparison-"some" clause ::
        > *some*
        < *some*
   + set comparison - "all" clasue ::
        > *all*
        *select* name
        *from* instructor
        *where* salary > *all* (*select* salary
                            *from* instructor
                            *where* dept_name = 'Biology');
   + Test for empty relations ::
        The *exists* construct returns the value *true* if te argument subquery
        is nonempty
   + not exists ::
   + unique ::
     + The *unique* construct tests whether a subquery has any duplicate tuples
       in its result
     + The *unique* construct evaluates to "true" if a given subquery contains no duplicates
   + with ::
     + provides a way of defining a temporary relation whose definition is available only to
       the query in which the *with* clause occurs
     + e.g
       *with* max_budget(value) *as*
           (*select max* (budget)
           *from* department)
       *select* department.name
       *from* department, max_budget
       *where* department.budget = max_budget.value;
     + is very useful for writing complex queries
     + with dept _total (dept_name, value) as
          (select dept_name, sum(salary)
           from instructor
           group by dept_name),
       dept_total_avg(value) as
          (select avg(value)
           from dept_total)
       select dept_name
       from dept_total, dept_total_avg
       where dept_total.value > dept_total_avg.value;
   + insertion ::
     + *insert into ...* *values* ....
     + *insert into* student
       *select* ID, name, dept_name, 0
       *from* instructor
     + *insert into* table1 *select* * *from* table1
   + update ::
     + *update* ... *set* .... *where* ...
     + *update* ... *set* ... *case* ...
       *when* ... *then* ...
       *else* ...
       *end*
* DONE
  CLOSED: [2018-04-02 一 13:15]
  :LOGBOOK:
  - State "DONE"       from "NEXT"       [2018-04-02 一 13:15]
  - State "NEXT"       from "DONE"       [2018-03-26 一 13:25]
  - State "DONE"       from "TODO"       [2018-03-26 一 12:44]
  :END:
first 3.8 3.9
3.10 3.11 3.15
4.7 4.9 4.12
* Chap4
** Joined relations
   + Join operation ::
     + takes two relations and return as a result another relation
   + outer join ::
     + an extension of the join operation that avoids loss of information
     + use *null* values
     + To distinguish normal joins from outer joins, normal joins are called
       inter joins in SQL.
   + inner join ::
     + equivalent to *join*
** View
   + In some cases, it's not desirable for all users to see the entire
     logical model
   + A *view* provides a mechanism to hide certain data from the view of certain
     users
   + *create view* v *as* <query expression>
   + once a view is defined, the view name can be used to refer to the
     virtual relation that the view generates.
   + view is not a table
   + Most SQL implementations allow update only on simple views
   + The *select* contains only attribute names of the relation and doesn't
     have any expressions, aggregates
*** Materialized views
   + Materializing a view ::
        create a physical table containing all the tuples in the result of the query
        defining the view
*** Transaction
    + Atomic transaction
      Either fully executed or rolled back as if never occured
*** Integrated constraints
    Integrity constraints guard against accidental damage to the database,
    by ensuring that authorized changes to the database don't result
    in a loss of data consistency
*** Referential integrity
    Ensures that a value that appears in one relation for a given set of attributes
    also appears for a certain set of attributes in another relation
** Complex check clause
   *check*
** DATATYPE
*** Built-in data types in SQL
   + date ::
            containing a (4 digit) year, month and data
   + time ::
            time of day, in hours, minutes
            *time* '09:00:30'
   + timestamp :: date plus time of day
   + interval :: period of time
                interval '1' day
