databaseconcept.tex
\subsection{Basic query structure}
\label{sec-6-3}
\begin{description}
\item[{select clause}] \begin{itemize}
\item to force the elimination of duplicates, insert the keyword \textbf{distinct}
\item \textbf{all} specifies that duplicates not to be removed
\item select * denotes all attributes.
\item An attribute can be a literal with no from clause
*select '437'*
results is a table with one column and a single row with value "437"
\item *select 'A' from instructor
result is a table with one column and N rows, each row with value "A"
\item Can also contain arithmetic expressions
\end{itemize}
\item[{where clause}] \begin{itemize}
\item Find the Cartesian product (select * from instructor, teaches)
generates every possible \textbf{instructor-teacher} pair
for common attribute, the attributes in the resulting table are renamed using
the relation name
\end{itemize}
\item[{join}] \begin{itemize}
\item the comma in from clause
\end{itemize}
\item[{natural join}] \begin{itemize}
\item select * from instructor natural join teaches
\end{itemize}
\item[{rename operation}] \begin{itemize}
\item \textbf{as}
\end{itemize}
\item[{string operation}] \begin{itemize}
\item \% matches any substring
\item underscore \_ matches any character
\item e.g. where name like '\%dar\%'
\item use \%: \%
\item concatenation ||
\item converting from upper to lower case
\item finding string length, extracting substring
\end{itemize}
\item[{ordering the display of tuples}] \begin{itemize}
\item select distinct name from instructor order by name
\item \textbf{desc} for descending order \textbf{asc} for ascending.
e.g. order by name desc
\item can sort on multiple attributes
e.g. order by dept$_{\text{name}}$, name
\end{itemize}
\item[{where clause predicates}] \begin{itemize}
\item \textbf{between}
       e.g. select name from instructor where salary between 90000 and 10000
\item tuple comparison
$(a_1,a_2)\le(b_1,b_2)$ iff $a_1\le b_1$ and $a_2\le b_2$
\end{itemize}
\item[{duplicate}] \begin{itemize}
\item Multiset
\end{itemize}
\item[{Set operation}] \begin{itemize}
\item union, intersect, except
each of the above operations automatically eliminates duplicates
\item to retain all duplicates, use union all, intersect all, except all
\end{itemize}
\item[{Null value}] \begin{itemize}
\item arithmetic expression involving null is null
\item is null can be used to check for null values
select name from instructor where salary is null
\end{itemize}
\item[{Aggregate functions}] \begin{itemize}
\item avg, min, max, sum, count
\item Except count, all aggregations apply to a single attribute
\item e.g. select avg(salary) from instructor where dept$_{\text{name}}$='Comp. Sci.';
\begin{center}
\begin{tabular}{r}
avg(salary)\\
750000\\
\end{tabular}
\end{center}
\item Find the number of tuples in the course relation
select count(*) from course;
\item[{grouping and aggregation}] \begin{itemize}
\item e.g. select product, sum from purchase group by product
\item 1.compute the from and where clauses
2.group by the attributes in the group
3.Compute the select clause
\end{itemize}
\item[{Having clause}] \begin{itemize}
\item predicates in the \textbf{having} clause are applied after the formation of groups
whereas predicates in the \textbf{where} clause are applied before groups
\end{itemize}
\item[{General form of grouping and aggregation}] \begin{itemize}
\item select S from R₁,\ldots{},Rₙ where C₁ group by a₁,\ldots{},aₙ having C₂
\end{itemize}
\end{itemize}
\item[{Nested subqueries}] \begin{itemize}
\item SQL provides a mechanism for the nesting of subqueries. A subquery is
a \textbf{select-from-where} expression that is nested within another query.
\end{itemize}
\item[{Set membership}] \begin{description}
\item[{in}] tests for set membership
\item[{not in}] 
\end{description}
\item[{set comparison-"some" clause}] > \textbf{some}
        < \textbf{some}
\item[{set comparison - "all" clasue}] > \textbf{all}
\textbf{select} name
\textbf{from} instructor
\textbf{where} salary > \textbf{all} (\textbf{select} salary
                    \textbf{from} instructor
                    \textbf{where} dept$_{\text{name}}$ = 'Biology');
\item[{Test for empty relations}] The \textbf{exists} construct returns the value \textbf{true} if te argument subquery
is nonempty
\item[{not exists}] 
\item[{unique}] \begin{itemize}
\item The \textbf{unique} construct tests whether a subquery has any duplicate tuples
in its result
\item The \textbf{unique} construct evaluates to "true" if a given subquery contains no duplicates
\end{itemize}
\item[{with}] \begin{itemize}
\item provides a way of defining a temporary relation whose definition is available only to
the query in which the \textbf{with} clause occurs
\item e.g
\textbf{with} max$_{\text{budget}}$(value) \textbf{as}
    (\textbf{select max} (budget)
    \textbf{from} department)
\textbf{select} department.name
\textbf{from} department, max$_{\text{budget}}$
\textbf{where} department.budget = max$_{\text{budget}}$.value;
\item is very useful for writing complex queries
\item with dept \_total (dept$_{\text{name}}$, value) as
   (select dept$_{\text{name}}$, sum(salary)
    from instructor
    group by dept$_{\text{name}}$),
dept$_{\text{total}}$$_{\text{avg}}$(value) as
   (select avg(value)
    from dept$_{\text{total}}$)
select dept$_{\text{name}}$
from dept$_{\text{total}}$, dept$_{\text{total}}$$_{\text{avg}}$
where dept$_{\text{total}}$.value > dept$_{\text{total}}$$_{\text{avg}}$.value;
\end{itemize}
\item[{insertion}] \begin{itemize}
\item \textbf{insert into \ldots{}} \textbf{values} \ldots{}.
\item \textbf{insert into} student
\textbf{select} ID, name, dept$_{\text{name}}$, 0
\textbf{from} instructor
\item \textbf{insert into} table1 \textbf{select} * \textbf{from} table1
\end{itemize}
\item[{update}] \begin{itemize}
\item \textbf{update} \ldots{} \textbf{set} \ldots{}. \textbf{where} \ldots{}
\item \textbf{update} \ldots{} \textbf{set} \ldots{} \textbf{case} \ldots{}
\textbf{when} \ldots{} \textbf{then} \ldots{}
\textbf{else} \ldots{}
\textbf{end}
\end{itemize}
\end{description}
\section{{\bfseries\sffamily DONE} }
\label{sec-7}
first 3.8 3.9
3.10 3.11 3.15
4.7 4.9 4.12
\section{Chap4}
\label{sec-8}
\subsection{Joined relations}
\label{sec-8-1}
\begin{description}
\item[{Join operation}] \begin{itemize}
\item takes two relations and return as a result another relation
\end{itemize}
\item[{outer join}] \begin{itemize}
\item an extension of the join operation that avoids loss of information
\item use \textbf{null} values
\item To distinguish normal joins from outer joins, normal joins are called
inter joins in SQL.
\end{itemize}
\item[{inner join}] \begin{itemize}
\item equivalent to \textbf{join}
\end{itemize}
\end{description}
\subsection{View}
\label{sec-8-2}
\begin{itemize}
\item In some cases, it's not desirable for all users to see the entire
logical model
\item A \textbf{view} provides a mechanism to hide certain data from the view of certain
users
\item \textbf{create view} v \textbf{as} <query expression>
\item once a view is defined, the view name can be used to refer to the
virtual relation that the view generates.
\item view is not a table
\item Most SQL implementations allow update only on simple views
\item The \textbf{select} contains only attribute names of the relation and doesn't
have any expressions, aggregates
\end{itemize}
\subsubsection{Materialized views}
\label{sec-8-2-1}
\begin{description}
\item[{Materializing a view}] create a physical table containing all the tuples in the result of the query
defining the view
\end{description}
\subsubsection{Transaction}
\label{sec-8-2-2}
\begin{itemize}
\item Atomic transaction
Either fully executed or rolled back as if never occured
\end{itemize}
\subsubsection{Integrated constraints}
\label{sec-8-2-3}
Integrity constraints guard against accidental damage to the database,
by ensuring that authorized changes to the database don't result
in a loss of data consistency
\subsubsection{Referential integrity}
\label{sec-8-2-4}
Ensures that a value that appears in one relation for a given set of attributes
also appears for a certain set of attributes in another relation
\subsection{Complex check clause}
\label{sec-8-3}
\textbf{check}
\subsection{DATATYPE}
\label{sec-8-4}
\subsubsection{Built-in data types in SQL}
\label{sec-8-4-1}
\begin{description}
\item[{date}] containing a (4 digit) year, month and data
\item[{time}] time of day, in hours, minutes
\textbf{time} '09:00:30'
\item[{timestamp}] date plus time of day
\item[{interval}] period of time
interval '1' day
\end{description}
