databaseconcept.org
*** index creation
   + *create* *index* studentID_index *on* student(ID)
   + indices are data structures used to *speed up* access to records with
     specified values for index attributes
   + e.g. select *
          from student
          where ID = '12345'
     can be executed by using the index to find the required record
     without looking at all records of student
*** User-defined
   + *create type* Dollars *as numeric* (12, 2) *final*
   + *create domain* person_name *char* (20) *not null*
*** large-object types
    + large object are stored as large object
      + blob :: binary large object
                object is a large collection of uninterpreted binary data
      + clob :: character large object
** Authorization
   + Forms of authorization on parts of the database ::
     + read
     + insert
     + update
     + delete
   + Forms of authorization to modify the database ::
     + index
     + resources
       allow creation of new relations
     + alteration
     + drop
*** Authorization specification in SQL
    + *grant* <privilege list>
      *on* <relation name or view name> *to* <user list>
    + <user list> is
      + a user-id
      + *public* which allows all valid users the privilege granted
      + a role
    + granting on a privilege on a view doesn't imply granting any privileges on
      the underlying relation
*** privileges in SQL
    + select ::
               *grant select on* instrutor *to* $U_1,U_2,U_3$
    + insert ::
*** revoking authorization in SQL
    + the revoke statement is used to revoke authorization
      *revoke* <privilege list>
      *on* <relation name or view name> *from* <user list>
*** role
    + *create role* instructor
    + *grant* instructor *to* Amil
    + *grant select on* takes *to* instructor
*** Authorization on views
    + *grant select on* geo_instructor *to* geo_staff
*** other authorization fearture
    + *grant reference* (dept_name) *on* department *to* Mariano
* Chap5
** Trigger
   + a statement that the system executes automatically by the system as a side
     effect of a modification to the database
   + to design, we must
     specify the condition
     specify the action
*** example
    time_slot_id is not a primary key, so cannot create a foreign key constraint
    Alternative we can use trigger
    *create trigger* timeslot_check1 *after insert on* sectin
    *referencing new row as* nrow
    *for each row*
    *when* (nrow.time_slot_id *not in* (
        *select* time_slot_id
        *from* time_slot))
    *begin*
        *rollback*
    *end*
*** triggering events and action in SQL
    + triggering event can be *insert, delete* or *update*
    + triggering on update can be restricted to specific attributes
      *after update of* takes *on* grade
    + values of attributes *before and after* an udpate can be referenced
      *reference old row as*
      *reference new row as*
    + triggers can be activated *before an event*
*** statement level triggers
    + instead of executing a seperate action for each affectedrow
      a single action can be executed for all rows affected by a transaction
      + use *for each statement*
      + use *referencing old table*
** Accessing SQL from a programming language
   + To write an embedded SQL query, we use
     *declare*
   + The *open* statment for our example is as follows:
     *EXEC SQL open c*;
     This statement causes the database system to execute the query
     and to save the results within a temporary relatoin
   + Dynamic SQL ::
   + Embedded SQL ::
     + the SQL statements are identified at compile time using a preprocessor
   + Procedural extensions and stored procedures
   + Functions
     + returns ::
                 indicates the variable-type taht is returned
     + return ::
                specifies the values that are to be returned as result of invoking
                the function
* DONE
  CLOSED: [2018-04-09 一 13:16]
  :LOGBOOK:
  - State "DONE"       from "TODO"       [2018-04-09 一 13:16]
  :END:
  5.15 5.17 5.21
  employee (employee name, street, city)
works (employee name, company name, salary)

* Chap7: Entity-relationship model
