databaseconcept.tex
\subsubsection{index creation}
\label{sec-8-4-2}
\begin{itemize}
\item \textbf{create} \textbf{index} studentID$_{\text{index}}$ \textbf{on} student(ID)
\item indices are data structures used to \textbf{speed up} access to records with
specified values for index attributes
\item e.g. select *
     from student
     where ID = '12345'
can be executed by using the index to find the required record
without looking at all records of student
\end{itemize}
\subsubsection{User-defined}
\label{sec-8-4-3}
\begin{itemize}
\item \textbf{create type} Dollars \textbf{as numeric} (12, 2) \textbf{final}
\item \textbf{create domain} person$_{\text{name}}$ \textbf{char} (20) \textbf{not null}
\end{itemize}
\subsubsection{large-object types}
\label{sec-8-4-4}
\begin{itemize}
\item large object are stored as large object
\begin{description}
\item[{blob}] binary large object
object is a large collection of uninterpreted binary data
\item[{clob}] character large object
\end{description}
\end{itemize}
\subsection{Authorization}
\label{sec-8-5}
\begin{description}
\item[{Forms of authorization on parts of the database}] \begin{itemize}
\item read
\item insert
\item update
\item delete
\end{itemize}
\item[{Forms of authorization to modify the database}] \begin{itemize}
\item index
\item resources
allow creation of new relations
\item alteration
\item drop
\end{itemize}
\end{description}
\subsubsection{Authorization specification in SQL}
\label{sec-8-5-1}
\begin{itemize}
\item \textbf{grant} <privilege list>
\textbf{on} <relation name or view name> \textbf{to} <user list>
\item <user list> is
\begin{itemize}
\item a user-id
\item \textbf{public} which allows all valid users the privilege granted
\item a role
\end{itemize}
\item granting on a privilege on a view doesn't imply granting any privileges on
the underlying relation
\end{itemize}
\subsubsection{privileges in SQL}
\label{sec-8-5-2}
\begin{description}
\item[{select}] \textbf{grant select on} instrutor \textbf{to} $U_1,U_2,U_3$
\item[{insert}] 
\end{description}
\subsubsection{revoking authorization in SQL}
\label{sec-8-5-3}
\begin{itemize}
\item the revoke statement is used to revoke authorization
\textbf{revoke} <privilege list>
\textbf{on} <relation name or view name> \textbf{from} <user list>
\end{itemize}
\subsubsection{role}
\label{sec-8-5-4}
\begin{itemize}
\item \textbf{create role} instructor
\item \textbf{grant} instructor \textbf{to} Amil
\item \textbf{grant select on} takes \textbf{to} instructor
\end{itemize}
\subsubsection{Authorization on views}
\label{sec-8-5-5}
\begin{itemize}
\item \textbf{grant select on} geo$_{\text{instructor}}$ \textbf{to} geo$_{\text{staff}}$
\end{itemize}
\subsubsection{other authorization fearture}
\label{sec-8-5-6}
\begin{itemize}
\item \textbf{grant reference} (dept$_{\text{name}}$) \textbf{on} department \textbf{to} Mariano
\end{itemize}
\section{Chap5}
\label{sec-9}
\subsection{Trigger}
\label{sec-9-1}
\begin{itemize}
\item a statement that the system executes automatically by the system as a side
effect of a modification to the database
\item to design, we must
specify the condition
specify the action
\end{itemize}
\subsubsection{example}
\label{sec-9-1-1}
time$_{\text{slot}}$$_{\text{id}}$ is not a primary key, so cannot create a foreign key constraint
Alternative we can use trigger
\textbf{create trigger} timeslot$_{\text{check1}}$ \textbf{after insert on} sectin
\textbf{referencing new row as} nrow
\textbf{for each row}
\textbf{when} (nrow.time$_{\text{slot}}$$_{\text{id}}$ \textbf{not in} (
    \textbf{select} time$_{\text{slot}}$$_{\text{id}}$
    \textbf{from} time$_{\text{slot}}$))
\textbf{begin}
    \textbf{rollback}
\textbf{end}
\subsubsection{triggering events and action in SQL}
\label{sec-9-1-2}
\begin{itemize}
\item triggering event can be \textbf{insert, delete} or \textbf{update}
\item triggering on update can be restricted to specific attributes
\textbf{after update of} takes \textbf{on} grade
\item values of attributes \textbf{before and after} an udpate can be referenced
\textbf{reference old row as}
\textbf{reference new row as}
\item triggers can be activated \textbf{before an event}
\end{itemize}
\subsubsection{statement level triggers}
\label{sec-9-1-3}
\begin{itemize}
\item instead of executing a seperate action for each affectedrow
a single action can be executed for all rows affected by a transaction
\begin{itemize}
\item use \textbf{for each statement}
\item use \textbf{referencing old table}
\end{itemize}
\end{itemize}
\subsection{Accessing SQL from a programming language}
\label{sec-9-2}
\begin{itemize}
\item To write an embedded SQL query, we use
\textbf{declare}
\item The \textbf{open} statment for our example is as follows:
\textbf{EXEC SQL open c};
This statement causes the database system to execute the query
and to save the results within a temporary relatoin
\item[{Dynamic SQL}] 
\item[{Embedded SQL}] \begin{itemize}
\item the SQL statements are identified at compile time using a preprocessor
\end{itemize}
\item Procedural extensions and stored procedures
\item Functions
\begin{description}
\item[{returns}] indicates the variable-type taht is returned
\item[{return}] specifies the values that are to be returned as result of invoking
the function
\end{description}
\end{itemize}
\section{{\bfseries\sffamily DONE} }
\label{sec-10}
  5.15 5.17 5.21
  employee (employee name, street, city)
works (employee name, company name, salary)

\section{Chap7: Entity-relationship model}
\label{sec-11}
