databaseconcept.org
** ER model
   + model ::
     + A database can be modeled as :
       a collection of entities
       relation among entities
     + An *entity* is an object that is distinguishable from all other objects
       An *entity* ahs a set of properties, and the values for some set of
       properties may uniquely identify an entity
     + entity set ::
       + a set of entities of the same type that share the same properties,
         or attributes
   + relation ::
     + A mathematical definition ::
       + Let A = {1, 2, 3}, B = {a, b, c, d}
       + We define a *relationship* of subset of $A\times B$
     + A *relationship* is an association among several entities.
     + relationship set ::
     + degree of relationship set ::
       + binary relationship
         involve two entity sets
         most relationship sets in a database system are binary
     + Attributes ::
     + mapping cardinality ::
     + redundant attributes ::
       + suppose we have entity sets
         instructor, with attributes including dept_name
         department
       + and a relationship
         inst_dept relating instructor and department
       + Attribute dept_name in entity instructor is redundant since there
         is an explicit relationship inst_dept which relates instructors
         to department
   + E-R diagram ::
     + Roles ::
       + Entity sets of a relationship needn't to be distinct
         Each occurence of an entity set plays a "role" in the relationship
       + Such as requisite course
       + The labels "course_id" and "prereq_id" are called roles
     + Cardinality constraint ::
          We express cardinality constraints by drawing either a directed
          line ->, signifying "one", or an undirected line (--), signifying
          "many"
       $\to$
     + one-to-one relationship, one-to-many, many-to-one, many-to-many
     + total participation ::
          every entity in the entity set participates in at least one relationship
          in the relationship set
     + Min and Max ::
       + A line may have an associtaed minimum and maximum cardinality, shown
         in the form l..h, where l is the minimum and h the maximum cardinality
       + A maximum value of * indicates no limit
     + Cardinality constraints on ternary relationship ::
     + Week entity set ::
       + An entity set that doesn't have a primary key is referred to as *weak*
         *entity set*
       + The existence of weak entity set depends on the existence of a
         *identifying entity set*
         + It must relate to the identifying entity set *via a total*,
           *one-to-many* relationship set from the identifying to the weak entity
           set
         + *identifying relationship* depicted using a double diamond
       + The *discriminator* of a weak entity set is the set of attributes that
         distinguishes among all the entities of a weak entity set
       + We underline the discriminator of a weak entity set with a dashed
         lien
     + Binary vs non-binary relationship
       + A ternary relationship parents, relating a child to his/her father and
         mother
       + Any non-binary relationship can be represented using binary relationships
         by creating an artificial entity set
     + Extended ER features ::
       + Specialization ::
         + top-down design process
       + Generalization ::
         + bottom-up design process
     + Aggregation ::
       + relation among relations
** UML
   + unified modeling language
* DONE
  CLOSED: [2018-04-16 一 12:54]
  :LOGBOOK:
  - State "DONE"       from "TODO"       [2018-04-16 一 12:54]
  :END:
  7.1 7.2 7.20
  Consider the E-R diagram in Figure 7.29, which models an online bookstore.
  a. List the entity sets and their primary keys.
  b. Suppose the bookstore adds Blu-ray discs and downloadable video
  to its collection. The same item may be present in one or both formats,
  with differing prices. Extend the E-R diagram to model this addition,
  ignoring the effect on shopping baskets.
  c. Now extend the E-R diagram, using generalization, to model the case
  where a shopping basket may contain any combination of books,
  Blu-ray discs, or downloadable video.
* Chap8: Relational database design
** First normal form
   + domain is *atomic* if its elements are considered to be indivisible units
   + First normal form ::
        the domain of all attributes are atomic
   + Atomicity is actually a property of how the elements of the domain are used
** Functional dependencies
   + constraints on the set of legal relations
   + require that the value for a certain set of attributes determines uniquely
     the value for another set of attributes
   + Let $R$ be a relation scheme
     $\alpha\subseteq R$ and $\beta\subseteq R$
   + the *functional dependency*
     $\alpha\to\beta$
     holds on $R$ if and only if for any legal relations r($R$), whenever any
     two tuples $t_1$ and $t_2$ of r agree on the attributes $\alpha$, they also
     agree on the attributes $\beta$ that is
     $t_1[\alpha]=t_2[\alpha]\Rightarrow t_1[\beta]=t_2[\beta]$
     | A | B |
     | 1 | 4 |
     | 1 | 5 |
     | 3 | 7 |
     here, $A\to B$ does *not* hold, but $B\to A$ hold
   + $K$ is a superkey for relation schema $R$ if and only if $K\to R$
     $K$ is a candidate key for $R$ if and only
     $K\to R$ and for no $a\subset K, a\to R$
   + *Functional dependencies* allow us to express constraints that cannot be expressed
     using superkeys. E.g.
     inst_dept(_ID_,name, salary, _dept_name_, building, budget)
     We would expect /dept_name/ $\to$ /building/ and /ID/ $\to$ /building/ hold
     but /dept_name/ $\to$ /salary/ does not hold
   + usage ::
     + To test relations to see if they are legal under a given set of functional dependencies
       + If a relation r is legal under a set F of functional dependencies, we say r
         *satisfies* F
     + specify constraints on the set of legal relations
       + We say /F/ *holds on* /R/ if all legal relations on /R/ satisfy the set of functional dependencies
         /F/
   + trivial ::
               it is satisfied by all instances of a relation
   + Closure of a set of functional dependencies ::
     + given a set $F$ of functional dependencies, there are certain other
       functional dependencies that are logically implies by $F$
       + e.g. If $A\to B$ and $B\to C$, then $A\to C$
     + The set of *all* functional dependencies logically implied by $F$ is the *closure* of $F$
       denoted by $F^+$
** Boyce-Codd normal form ::
   + A relation schema $R$ is in BCNF w.r.t to a set $F$ of functional
     dependencies if for all functional dependencies in $F^+$ of the form
     $\alpha\to\beta$, at least one of the following holds:
     $\alpha\to\beta$ is trivial
     $\alpha$ is a superkey of $R$
   + decomposing a schema into BCNF
     Supposing we have a schema /R/ and a non-trivial dependency $\alpha\to\beta$ causes
     a violation of BCNF
     We decompose /R/ into:
     ($\alpha\cup\beta$)
     (R-($\beta-\alpha$))
   + BCNF and dependency predervation
