databaseconcept.tex
\subsection{ER model}
\label{sec-11-1}
\begin{description}
\item[{model}] \begin{itemize}
\item A database can be modeled as :
a collection of entities
relation among entities
\item An \textbf{entity} is an object that is distinguishable from all other objects
An \textbf{entity} ahs a set of properties, and the values for some set of
properties may uniquely identify an entity
\item[{entity set}] \begin{itemize}
\item a set of entities of the same type that share the same properties,
or attributes
\end{itemize}
\end{itemize}
\item[{relation}] \begin{description}
\item[{A mathematical definition}] \begin{itemize}
\item Let A = \{1, 2, 3\}, B = \{a, b, c, d\}
\item We define a \textbf{relationship} of subset of $A\times B$
\end{itemize}
\item A \textbf{relationship} is an association among several entities.
\item[{relationship set}] 
\item[{degree of relationship set}] \begin{itemize}
\item binary relationship
involve two entity sets
most relationship sets in a database system are binary
\end{itemize}
\item[{Attributes}] 
\item[{mapping cardinality}] 
\item[{redundant attributes}] \begin{itemize}
\item suppose we have entity sets
instructor, with attributes including dept$_{\text{name}}$
department
\item and a relationship
inst$_{\text{dept}}$ relating instructor and department
\item Attribute dept$_{\text{name}}$ in entity instructor is redundant since there
is an explicit relationship inst$_{\text{dept}}$ which relates instructors
to department
\end{itemize}
\end{description}
\item[{E-R diagram}] \begin{description}
\item[{Roles}] \begin{itemize}
\item Entity sets of a relationship needn't to be distinct
Each occurence of an entity set plays a "role" in the relationship
\item Such as requisite course
\item The labels "course$_{\text{id}}$" and "prereq$_{\text{id}}$" are called roles
\end{itemize}
\item[{Cardinality constraint}] We express cardinality constraints by drawing either a directed
   line ->, signifying "one", or an undirected line (--), signifying
   "many"
$\to$
\item one-to-one relationship, one-to-many, many-to-one, many-to-many
\item[{total participation}] every entity in the entity set participates in at least one relationship
in the relationship set
\item[{Min and Max}] \begin{itemize}
\item A line may have an associtaed minimum and maximum cardinality, shown
in the form l..h, where l is the minimum and h the maximum cardinality
\item A maximum value of * indicates no limit
\end{itemize}
\item[{Cardinality constraints on ternary relationship}] 
\item[{Week entity set}] \begin{itemize}
\item An entity set that doesn't have a primary key is referred to as \textbf{weak}
         \textbf{entity set}
\item The existence of weak entity set depends on the existence of a
\textbf{identifying entity set}
\begin{itemize}
\item It must relate to the identifying entity set \textbf{via a total},
\textbf{one-to-many} relationship set from the identifying to the weak entity
set
\item \textbf{identifying relationship} depicted using a double diamond
\end{itemize}
\item The \textbf{discriminator} of a weak entity set is the set of attributes that
distinguishes among all the entities of a weak entity set
\item We underline the discriminator of a weak entity set with a dashed
lien
\end{itemize}
\item Binary vs non-binary relationship
\begin{itemize}
\item A ternary relationship parents, relating a child to his/her father and
mother
\item Any non-binary relationship can be represented using binary relationships
by creating an artificial entity set
\end{itemize}
\item[{Extended ER features}] \begin{description}
\item[{Specialization}] \begin{itemize}
\item top-down design process
\end{itemize}
\item[{Generalization}] \begin{itemize}
\item bottom-up design process
\end{itemize}
\end{description}
\item[{Aggregation}] \begin{itemize}
\item relation among relations
\end{itemize}
\end{description}
\end{description}
\subsection{UML}
\label{sec-11-2}
\begin{itemize}
\item unified modeling language
\end{itemize}
\section{{\bfseries\sffamily DONE} }
\label{sec-12}
7.1 7.2 7.20
Consider the E-R diagram in Figure 7.29, which models an online bookstore.
a. List the entity sets and their primary keys.
b. Suppose the bookstore adds Blu-ray discs and downloadable video
to its collection. The same item may be present in one or both formats,
with differing prices. Extend the E-R diagram to model this addition,
ignoring the effect on shopping baskets.
c. Now extend the E-R diagram, using generalization, to model the case
where a shopping basket may contain any combination of books,
Blu-ray discs, or downloadable video.
\section{Chap8: Relational database design}
\label{sec-13}
\subsection{First normal form}
\label{sec-13-1}
\begin{itemize}
\item domain is \textbf{atomic} if its elements are considered to be indivisible units
\item[{First normal form}] the domain of all attributes are atomic
\item Atomicity is actually a property of how the elements of the domain are used
\end{itemize}
\subsection{Functional dependencies}
\label{sec-13-2}
\begin{itemize}
\item constraints on the set of legal relations
\item require that the value for a certain set of attributes determines uniquely
the value for another set of attributes
\item Let $R$ be a relation scheme
$\alpha\subseteq R$ and $\beta\subseteq R$
\item the \textbf{functional dependency}
$\alpha\to\beta$
holds on $R$ if and only if for any legal relations r($R$), whenever any
two tuples $t_1$ and $t_2$ of r agree on the attributes $\alpha$, they also
agree on the attributes $\beta$ that is
$t_1[\alpha]=t_2[\alpha]\Rightarrow t_1[\beta]=t_2[\beta]$
\begin{center}
\begin{tabular}{rr}
A & B\\
1 & 4\\
1 & 5\\
3 & 7\\
\end{tabular}
\end{center}
here, $A\to B$ does \textbf{not} hold, but $B\to A$ hold
\item $K$ is a superkey for relation schema $R$ if and only if $K\to R$
$K$ is a candidate key for $R$ if and only
$K\to R$ and for no $a\subset K, a\to R$
\item \textbf{Functional dependencies} allow us to express constraints that cannot be expressed
using superkeys. E.g.
inst$_{\text{dept}}$($_{\text{ID}}$\_,name, salary, \uline{dept$_{\text{name}}$}, building, budget)
We would expect \emph{dept$_{\text{name}}$} $\to$ \emph{building} and \emph{ID} $\to$ \emph{building} hold
but \emph{dept$_{\text{name}}$} $\to$ \emph{salary} does not hold
\item[{usage}] \begin{itemize}
\item To test relations to see if they are legal under a given set of functional dependencies
\begin{itemize}
\item If a relation r is legal under a set F of functional dependencies, we say r
\textbf{satisfies} F
\end{itemize}
\item specify constraints on the set of legal relations
\begin{itemize}
\item We say \emph{F} \textbf{holds on} \emph{R} if all legal relations on \emph{R} satisfy the set of functional dependencies
\emph{F}
\end{itemize}
\end{itemize}
\item[{trivial}] it is satisfied by all instances of a relation
\item[{Closure of a set of functional dependencies}] \begin{itemize}
\item given a set $F$ of functional dependencies, there are certain other
functional dependencies that are logically implies by $F$
\begin{itemize}
\item e.g. If $A\to B$ and $B\to C$, then $A\to C$
\end{itemize}
\item The set of \textbf{all} functional dependencies logically implied by $F$ is the \textbf{closure} of $F$
       denoted by $F^+$
\end{itemize}
\end{itemize}
\subsection{Boyce-Codd normal form ::}
\label{sec-13-3}
\begin{itemize}
\item A relation schema $R$ is in BCNF w.r.t to a set $F$ of functional
dependencies if for all functional dependencies in $F^+$ of the form
$\alpha\to\beta$, at least one of the following holds:
$\alpha\to\beta$ is trivial
$\alpha$ is a superkey of $R$
\item decomposing a schema into BCNF
Supposing we have a schema \emph{R} and a non-trivial dependency $\alpha\to\beta$ causes
a violation of BCNF
We decompose \emph{R} into:
($\alpha\cup\beta$)
(R-($\beta-\alpha$))
\item BCNF and dependency predervation
\end{itemize}
