databaseconcept.org
** Third normal form
   + for all $\alpha\to\beta$ in $F^+$, at least one of the following holds
     $\alpha\to\beta$ is trivial
     $\alpha$ is a superkey for R
     Each attribute A in $\beta - \alpha$ is contained in a candidate key for R
   + Goals of normalization ::
     + Let /R/ be a relation scheme with a set /F/ of functional dependencies
     + Decide whether a relation /R/ is in "good" form
     + In the case that a relation scheme /R/ is not in "good" form,
       decompose it into the set of relation scheme $\{R_1,\dots,R_n\}$ such that
       + each relation scheme is in good form
       + the decomposition is a lossless-join decomposition
       + the decomposition should be denpendency preserving
   + minimal relaxiation of BCNF
** How good is BCNF
   + consider a relation ::
     + inst_info(ID, child_name, phone)
     +
        |    ID | child_name |        phone |
        | 99999 | David      | 512-555-1234 |
        | 99999 | David      | 512-555-4321 |
        | 99999 | William    | 512-555-1234 |
        | 99999 | William    | 512-555-4321 |
   + problem ::
     + there are no non-trivial functional dependencies and therefore
       the relation in BCNF
     + insertion anomalies -- if we add a phone 981-992-3443 to 99999,
       we need to add two tupples
       (99999, David, 981-992-3443)
       (99999, William, 981-992-3443)
   + solution ::
                decompose /inst_info/ into two tables
** Closure of attributes sets
   + Armstrong's axioms ::
     + reflexivity :: if $\beta\subseteq\alpha$, then $\alpha\to\beta$
     + augmentation :: if $\alpha\to\beta$, then $\gamma\alpha\to\gamma\beta$
     + transitivity :: if $\alpha\to\beta$ and $\beta\to\gamma$, then $\alpha\to\gamma$
     + these rules are
       + *sound* (generate only functional dependencies that actually hold)
       + *complete* (generate all functional dependencies that hold)
   + Another rule ::
     + Union rule :: if $\alpha\to\beta$ and $\alpha\to\gamma$, then $\alpha\to\beta\gamma$
     + Decomposition rule :: if $\alpha\to\beta\gamma$, then $\alpha\to\beta,\alpha\to\gamma$
     + Pseudotransitivity rule :: If $\alpha\to\beta$ and $\gamma\beta\to\delta$, then $\alpha\gamma\to\delta$
   + Canonical Cover
     + If we perform a update on the relation, the system must ensure the
       update doesn't violate any functional dependencies. We need the reduce
       the check time
     + extraneous attributes ::
       + Consider a set F of functional dependencies and the functional
         dependency $\alpha\to\beta$ in F
       + A is extraneous in $\alpha$ if $A\in\alpha,F\to(F-\{\alpha\to\beta\})\cup\{(\alpha-A)\to\beta\}$
       + A is extraneous in $\beta$ if $A\in\beta, (F-\{\alpha\to\beta\})\cup\{\alpha\to(\beta-A)\}\to F$
       + For example, if we have $AB\to C, A\to C$, then B is extraneous in $AB\to C$
       + If $A\in\beta$, consider the set $F'=(F-\{\alpha\to\beta\})\cup\{\alpha\to(\beta-A)\}$
         check if $\alpha\to A$ can be inferred from $F'$. Compute $\alpha^+$ under $F'$, if $\alpha^+$
         includes A, then A is extraneous in $\beta$
       + If $A\in\alpha$, let $\gamma=\alpha-\{A\}$ and check if $\gamma\to\beta$ can be inferred from F.
         To do so, compute $\gamma^+$ under F, if $\gamma^+$ includes all attributes in $\beta$
         then A is extraneous
       + Canonical cover $F_c$'s properties ::
         + $F_c\Leftrightarrow F$
         + No functional dependency in $F_c$ contains an extraneous attribute
         + Each left side of a functional dependency in $F_c$ is unique.
           $\forall \alpha_1\to\beta_1, \alpha_2\to\beta_2\in F_c,\alpha_1\neq\alpha_2$
   + Lossless decomposition ::
     + We say that decomposition is a lossless decomposition if there is no loss
       of information by replacing $r(R)$ with two relation schemas $r_1(R_1),r_2(R_2)$
       Or $\Pi_{R_1}(r)\bowtie\Pi_{R_2}(r)=r$
     + we can use functional dependencies to show when certain decompositions are lossless.
       If at least one of the following functional dependencies is in $F^+$:
       $R_1\cap R_2\to R_1$
       $R_1\cap R_2\to R_2$
   + Dependency preservation ::
     + Let F be a set of functional dependencies on a schema R, and let $R_1, \dots,R_n$ be
       a decomposition of R. The *restriction* of F to $R_i$ is the set $F_i$ of all functional
       dependencies in $F^+$ that include /only/ attributes of $R_i$
     + Let $F'=F_1\cup\dots\cup F_n$, $F'^+=F^+$ is a *dependency-preserving decomposition*
** Algorithms for decomposition
*** BCNF
    + BCNF testing ::
      For every subset $\alpha$ of attributes in $R_i$, check that $\alpha^+$ either includes no
      attribute of $R_i-\alpha$ or includes all attributes of $R_i$
    + BCNF decomposition ::
         + pseudocode
           #+BEGIN_SRC python
             result = {R}
             done = False
             F+=...
             while not done:
                 if Ri is not BCNF
                     alphatobeta = nontrivial functional dependency hold on Ri and alphatoRi not in F+
                     and alphacapbeta = None
                     result = (result - Ri) cup (Ri - beta) cup (alpha, beta)
                 else
                     done = True
           #+END_SRC
*** 3NF decomposition
#+BEGIN_SRC python
  F_c = canonical cover for F
  i = 0
  for $\alpha\to\beta$ in F_c:
      i = i + 1
      R_i = $\alpha\beta$
  if none of R_i contains a candidate keys:
      i = i + 1
      R_i = any candidate key of R
  while R_j can be deleted(contains in another R):
      R_j = R_i
      i = i - 1
  return (R_1, R_2, ..., R_i)
#+END_SRC
