databaseconcept.tex
\subsection{Third normal form}
\label{sec-13-4}
\begin{itemize}
\item for all $\alpha\to\beta$ in $F^+$, at least one of the following holds
$\alpha\to\beta$ is trivial
$\alpha$ is a superkey for R
Each attribute A in $\beta - \alpha$ is contained in a candidate key for R
\item[{Goals of normalization}] \begin{itemize}
\item Let \emph{R} be a relation scheme with a set \emph{F} of functional dependencies
\item Decide whether a relation \emph{R} is in "good" form
\item In the case that a relation scheme \emph{R} is not in "good" form,
decompose it into the set of relation scheme $\{R_1,\dots,R_n\}$ such that
\begin{itemize}
\item each relation scheme is in good form
\item the decomposition is a lossless-join decomposition
\item the decomposition should be denpendency preserving
\end{itemize}
\end{itemize}
\item minimal relaxiation of BCNF
\end{itemize}
\subsection{How good is BCNF}
\label{sec-13-5}
\begin{description}
\item[{consider a relation}] \begin{itemize}
\item inst$_{\text{info}}$(ID, child$_{\text{name}}$, phone)
\item \begin{center}
\begin{tabular}{rlr}
ID & child$_{\text{name}}$ & phone\\
99999 & David & 512-555-1234\\
99999 & David & 512-555-4321\\
99999 & William & 512-555-1234\\
99999 & William & 512-555-4321\\
\end{tabular}
\end{center}
\end{itemize}
\item[{problem}] \begin{itemize}
\item there are no non-trivial functional dependencies and therefore
the relation in BCNF
\item insertion anomalies -- if we add a phone 981-992-3443 to 99999,
we need to add two tupples
(99999, David, 981-992-3443)
(99999, William, 981-992-3443)
\end{itemize}
\item[{solution}] decompose \emph{inst$_{\text{info}}$} into two tables
\end{description}
\subsection{Closure of attributes sets}
\label{sec-13-6}
\begin{description}
\item[{Armstrong's axioms}] \begin{description}
\item[{reflexivity}] if $\beta\subseteq\alpha$, then $\alpha\to\beta$
\item[{augmentation}] if $\alpha\to\beta$, then $\gamma\alpha\to\gamma\beta$
\item[{transitivity}] if $\alpha\to\beta$ and $\beta\to\gamma$, then $\alpha\to\gamma$
\item these rules are
\begin{itemize}
\item \textbf{sound} (generate only functional dependencies that actually hold)
\item \textbf{complete} (generate all functional dependencies that hold)
\end{itemize}
\end{description}
\item[{Another rule}] \begin{description}
\item[{Union rule}] if $\alpha\to\beta$ and $\alpha\to\gamma$, then $\alpha\to\beta\gamma$
\item[{Decomposition rule}] if $\alpha\to\beta\gamma$, then $\alpha\to\beta,\alpha\to\gamma$
\item[{Pseudotransitivity rule}] If $\alpha\to\beta$ and $\gamma\beta\to\delta$, then $\alpha\gamma\to\delta$
\end{description}
\item Canonical Cover
\begin{itemize}
\item If we perform a update on the relation, the system must ensure the
update doesn't violate any functional dependencies. We need the reduce
the check time
\item[{extraneous attributes}] \begin{itemize}
\item Consider a set F of functional dependencies and the functional
dependency $\alpha\to\beta$ in F
\item A is extraneous in $\alpha$ if $A\in\alpha,F\to(F-\{\alpha\to\beta\})\cup\{(\alpha-A)\to\beta\}$
\item A is extraneous in $\beta$ if $A\in\beta, (F-\{\alpha\to\beta\})\cup\{\alpha\to(\beta-A)\}\to F$
\item For example, if we have $AB\to C, A\to C$, then B is extraneous in $AB\to C$
\item If $A\in\beta$, consider the set $F'=(F-\{\alpha\to\beta\})\cup\{\alpha\to(\beta-A)\}$
         check if $\alpha\to A$ can be inferred from $F'$. Compute $\alpha^+$ under $F'$, if $\alpha^+$
         includes A, then A is extraneous in $\beta$
\item If $A\in\alpha$, let $\gamma=\alpha-\{A\}$ and check if $\gamma\to\beta$ can be inferred from F.
To do so, compute $\gamma^+$ under F, if $\gamma^+$ includes all attributes in $\beta$
then A is extraneous
\item[{Canonical cover $F_c$'s properties}] \begin{itemize}
\item $F_c\Leftrightarrow F$
\item No functional dependency in $F_c$ contains an extraneous attribute
\item Each left side of a functional dependency in $F_c$ is unique.
$\forall \alpha_1\to\beta_1, \alpha_2\to\beta_2\in F_c,\alpha_1\neq\alpha_2$
\end{itemize}
\end{itemize}
\end{itemize}
\item[{Lossless decomposition}] \begin{itemize}
\item We say that decomposition is a lossless decomposition if there is no loss
of information by replacing $r(R)$ with two relation schemas $r_1(R_1),r_2(R_2)$
Or $\Pi_{R_1}(r)\bowtie\Pi_{R_2}(r)=r$
\item we can use functional dependencies to show when certain decompositions are lossless.
If at least one of the following functional dependencies is in $F^+$:
$R_1\cap R_2\to R_1$
$R_1\cap R_2\to R_2$
\end{itemize}
\item[{Dependency preservation}] \begin{itemize}
\item Let F be a set of functional dependencies on a schema R, and let $R_1, \dots,R_n$ be
a decomposition of R. The \textbf{restriction} of F to $R_i$ is the set $F_i$ of all functional
dependencies in $F^+$ that include \emph{only} attributes of $R_i$
\item Let $F'=F_1\cup\dots\cup F_n$, $F'^+=F^+$ is a \textbf{dependency-preserving decomposition}
\end{itemize}
\end{description}
\subsection{Algorithms for decomposition}
\label{sec-13-7}
\subsubsection{BCNF}
\label{sec-13-7-1}
\begin{description}
\item[{BCNF testing}] For every subset $\alpha$ of attributes in $R_i$, check that $\alpha^+$ either includes no
attribute of $R_i-\alpha$ or includes all attributes of $R_i$
\item[{BCNF decomposition}] \begin{itemize}
\item pseudocode
\lstset{language=Python,label= ,caption= ,numbers=none}
\begin{lstlisting}
result = {R}
done = False
F+=...
while not done:
    if Ri is not BCNF
        alphatobeta = nontrivial functional dependency hold on Ri and alphatoRi not in F+
        and alphacapbeta = None
        result = (result - Ri) cup (Ri - beta) cup (alpha, beta)
    else
        done = True
\end{lstlisting}
\end{itemize}
\end{description}
\subsubsection{3NF decomposition}
\label{sec-13-7-2}
\lstset{language=Python,label= ,caption= ,numbers=none}
\begin{lstlisting}
F_c = canonical cover for F
i = 0
for $\alpha\to\beta$ in F_c:
    i = i + 1
    R_i = $\alpha\beta$
if none of R_i contains a candidate keys:
    i = i + 1
    R_i = any candidate key of R
while R_j can be deleted(contains in another R):
    R_j = R_i
    i = i - 1
return (R_1, R_2, ..., R_i)
\end{lstlisting}
