databaseconcept.org
** Decomposition using multivalued dependencies
   + Multivalued dependencies
     + Multivalued dependencies, on the other hand, do not rule out the existence of
       certain tuples. Instead, theyrequire that other tuples of a certain form be present in
       the relation.
     + Let r(R) be a relation schema and let $\alpha\subseteq R$ and $\beta\subseteq R$. The *multivalued dependency*
       $\alpha\twoheadrightarrow\beta$
       holds on R if in any legal instance of relation r(R), for pairs of tuples $t_1, t_2$ in r
       such that $t_1[\alpha]=t_2[\alpha]$, there exist tuples $t_3,t_4$ s.t.
       $t_1[\alpha]=t_2[\alpha]=t_3[\alpha]=t_4[\alpha]$
       $t_3[\beta]=t_1[\beta]$
       $t_3[R-\beta]=t_2[R-\beta]$
       $t_4[\beta]=t_2[\beta]
       $t_4[R-\beta]=t_1[R-\beta]$
       |     | \alpha    | \beta         | R-\alpha-\beta |
       | t_1 | a_1...a_i | a_{i+1}...a_j | a_{j+1}...a_n  |
       | t_2 | a_1...a_i | b_{i+1}...b_j | b_{j+1}...b_n  |
       | t_3 | a_1...a_i | a_{i+1}...a_j | b_{j+1}...b_n  |
       | t_4 | a_1...a_i | b_{i+1}...b_j | a_{j+1}...a_n  |
     + If $\alpha\to\beta$, then $\alpha\twoheadrightarrow\beta$
       If $\alpha\twoheadrightarrow\beta$, then $\alpha\twoheadrightarrow R-\alpha-\beta$
   + Fourth normal form
     + for all multivalued dependencies in $D^+$, at least one of the following holds
       + $\alpha\twoheadrightarrow\beta$ is a trivial multivalued dependency
       + $\alpha$ is a superkey for R
     + Every 4NF schema is in BCNF
     + *restriction* of D to $R_i$ is the set $D_i$ consisting of:
       + All functional dependencies in $D^+$ that include only attributes of $R_i$
       + All multivalued dependencies of the form:
         $\alpha\twoheadrightarrow\beta\cap R_i$
         where $\alpha\subseteq R_i$ and $\alpha\twoheadrightarrow\beta$ is in $D^+$
     + Decomposition ::
                       + really same to BCNF
* Chap10
** Overview
   cache
   main memory
   flash memory
   magnetic disk
   optical disk
   magnetic tapes
** Magnetic disk and flash storage
*** physical characteristics of disks
    + a disk contains many *platter*
    + each disk *platter* has a flat, circular shape
    + the disk surface is logically divided into *tracks*, which are subdivided into
      *sectors*. A *sector* is the smalles unit of information
    + ith tracks of all the platters together are called the ith *cylinder*
    + *disk controller*
*** Performance measures of disks
    + Access time ::
      + the time it takes *from* when a read or write request is issued *to* when
        data transfer begins. Consist of:
        + Seek time(寻道时间) ::
          + time it takes to reposition the arm over the correct track
        + Rotational latency ::
          + time it takes for the *sector* to be accessed to appear under the head
    + Data-transfer rate ::
      + the rate at which data can be retrived from or stored to the disk
    + Mean time to failure(MTTF)(平均故障间隔期) ::
      + the average time the disk is expected to run continuously without any
        failure
      + 总磁盘越多，随机的磁盘发生故障成为常态
*** optimization of disk-block access
    + Block ::
      + a contiguous sequence of sectors from a single track
      + data is transfered between disk and main memory in blocks
    + Disk-arm-scheduling ::
      + algorithms order pending accesses to tracks so that disk arm movement
        is minimized
      + elevator algorithm
    + File organization ::
      + optimize block access time by organizing the blocks to correspend to
        how data will be accessed
      + e.g. store related information on the same nearby cylinders
    + Nonvolatile write buffers ::
      + speed up disk writes by writing blocks to a non-volatile RAM buffer
        immediately
      + controller then writes to disk whenever the disk has no other requests
        or request has been pending for some time
    + Log disk ::
      + a disk devoted to writing a sequential log of block updates
      + used like nonvolatile RAM
*** flash storage
    + NAND flash ::
      + requires page-at-a-time read
      + ssd (solid state disks) use multiple flash storage
      + erase is slow
** RAID(Redundant arrays of independent disks)
   + high capacity and high speed by using multiple disks in parallel.
     high reliability by storing data redundantly
   + redundancy ::
     + store extra information that can be used to rebuild information
       lost in a disk failure
     + E.g. *Mirroring*
   + Mean time to failure
*** improvement in performance via parallelism
    + two main goals of parallelism in a disk system
      + load balance multiple small accesses to increase throughput
      + parallelize large accesses to reduce response time
    + bit-level striping :: split the bits of each byte across multiple disks
    + block-level striping :: with n disks, block i goes to disk (i mod n) + 1
*** Raid level
** File organization
*** fixed-length records
    + store record i starting from byte n * (i - 1), where n is the size of each record
    + deletion
      + free list
        store the address of the first deleted record in the file header
*** varaible-length record
    + arise in several ways
      + storage of multiple record types in a file
      + record types that allow variable lengths for one or more fields such as strings
      + record types that allow repeating fields
    + variable length attributes represented by fixed szie, with actual data stored after
      all fixed length attributes
    + null values represented by null-value bitmap
    + slotted page structure ::
      + contains
        number of record entries
        end of free space in the block
        location and size of each record
      + records can be moved around within a page to keep them contiguous with no empty space
        between them
      + pointers shouldn't point directly to record--instead they should point to the entry
        for the record in header
*** organization of records in files
    + sequential file organization
    + multitable clustering file organization
** data dictionary storage
   + data dictionary stores *metadata*
   + information about relations
   + user and accouting information
   + statistical and descriptive data
   + physical file organization
* TODO
  10.8 10.14 10.17
* Chap 11
** Basic concepts
   + index file ::
     + consist of records of the form
       | search-key | pointer |
     + two kinds of indices
       + ordered indices
         + primary index
           + the index whose search key specifies the sequential order of the file
         + secondary index
           + the index whose search key specifies the sequential order of the file
       + hash indices
     + index evaluation metrics
       + access types
       + access time
       + insertion time
       + deletion time
       + space overhead
