databaseconcept.tex
\subsection{Decomposition using multivalued dependencies}
\label{sec-13-8}
\begin{itemize}
\item Multivalued dependencies
\begin{itemize}
\item Multivalued dependencies, on the other hand, do not rule out the existence of
certain tuples. Instead, theyrequire that other tuples of a certain form be present in
the relation.
\item Let r(R) be a relation schema and let $\alpha\subseteq R$ and $\beta\subseteq R$. The \textbf{multivalued dependency}
$\alpha\twoheadrightarrow\beta$
holds on R if in any legal instance of relation r(R), for pairs of tuples $t_1, t_2$ in r
such that $t_1[\alpha]=t_2[\alpha]$, there exist tuples $t_3,t_4$ s.t.
$t_1[\alpha]=t_2[\alpha]=t_3[\alpha]=t_4[\alpha]$
$t_3[\beta]=t_1[\beta]$
$t_3[R-\beta]=t_2[R-\beta]$
\$t$_{\text{4[}\beta\text{]}}$=t$_{\text{2[}\beta\text{]}}$
$t_4[R-\beta]=t_1[R-\beta]$
\begin{center}
\begin{tabular}{llll}
 & $\alpha$ & $\beta$ & R-$\alpha$-$\beta$\\
t$_{\text{1}}$ & a$_{\text{1}}$\ldots{}a$_{\text{i}}$ & a$_{\text{i+1}}$\ldots{}a$_{\text{j}}$ & a$_{\text{j+1}}$\ldots{}a$_{\text{n}}$\\
t$_{\text{2}}$ & a$_{\text{1}}$\ldots{}a$_{\text{i}}$ & b$_{\text{i+1}}$\ldots{}b$_{\text{j}}$ & b$_{\text{j+1}}$\ldots{}b$_{\text{n}}$\\
t$_{\text{3}}$ & a$_{\text{1}}$\ldots{}a$_{\text{i}}$ & a$_{\text{i+1}}$\ldots{}a$_{\text{j}}$ & b$_{\text{j+1}}$\ldots{}b$_{\text{n}}$\\
t$_{\text{4}}$ & a$_{\text{1}}$\ldots{}a$_{\text{i}}$ & b$_{\text{i+1}}$\ldots{}b$_{\text{j}}$ & a$_{\text{j+1}}$\ldots{}a$_{\text{n}}$\\
\end{tabular}
\end{center}
\item If $\alpha\to\beta$, then $\alpha\twoheadrightarrow\beta$
       If $\alpha\twoheadrightarrow\beta$, then $\alpha\twoheadrightarrow R-\alpha-\beta$
\end{itemize}
\item Fourth normal form
\begin{itemize}
\item for all multivalued dependencies in $D^+$, at least one of the following holds
\begin{itemize}
\item $\alpha\twoheadrightarrow\beta$ is a trivial multivalued dependency
\item $\alpha$ is a superkey for R
\end{itemize}
\item Every 4NF schema is in BCNF
\item \textbf{restriction} of D to $R_i$ is the set $D_i$ consisting of:
\begin{itemize}
\item All functional dependencies in $D^+$ that include only attributes of $R_i$
\item All multivalued dependencies of the form:
$\alpha\twoheadrightarrow\beta\cap R_i$
where $\alpha\subseteq R_i$ and $\alpha\twoheadrightarrow\beta$ is in $D^+$
\end{itemize}
\item[{Decomposition}] \begin{itemize}
\item really same to BCNF
\end{itemize}
\end{itemize}
\end{itemize}
\section{Chap10}
\label{sec-14}
\subsection{Overview}
\label{sec-14-1}
cache
main memory
flash memory
magnetic disk
optical disk
magnetic tapes
\subsection{Magnetic disk and flash storage}
\label{sec-14-2}
\subsubsection{physical characteristics of disks}
\label{sec-14-2-1}
\begin{itemize}
\item a disk contains many \textbf{platter}
\item each disk \textbf{platter} has a flat, circular shape
\item the disk surface is logically divided into \textbf{tracks}, which are subdivided into
\textbf{sectors}. A \textbf{sector} is the smalles unit of information
\item ith tracks of all the platters together are called the ith \textbf{cylinder}
\item \textbf{disk controller}
\end{itemize}
\subsubsection{Performance measures of disks}
\label{sec-14-2-2}
\begin{description}
\item[{Access time}] \begin{itemize}
\item the time it takes \textbf{from} when a read or write request is issued \textbf{to} when
data transfer begins. Consist of:
\begin{description}
\item[{Seek time(寻道时间)}] \begin{itemize}
\item time it takes to reposition the arm over the correct track
\end{itemize}
\item[{Rotational latency}] \begin{itemize}
\item time it takes for the \textbf{sector} to be accessed to appear under the head
\end{itemize}
\end{description}
\end{itemize}
\item[{Data-transfer rate}] \begin{itemize}
\item the rate at which data can be retrived from or stored to the disk
\end{itemize}
\item[{Mean time to failure(MTTF)(平均故障间隔期)}] \begin{itemize}
\item the average time the disk is expected to run continuously without any
failure
\item 总磁盘越多，随机的磁盘发生故障成为常态
\end{itemize}
\end{description}
\subsubsection{optimization of disk-block access}
\label{sec-14-2-3}
\begin{description}
\item[{Block}] \begin{itemize}
\item a contiguous sequence of sectors from a single track
\item data is transfered between disk and main memory in blocks
\end{itemize}
\item[{Disk-arm-scheduling}] \begin{itemize}
\item algorithms order pending accesses to tracks so that disk arm movement
is minimized
\item elevator algorithm
\end{itemize}
\item[{File organization}] \begin{itemize}
\item optimize block access time by organizing the blocks to correspend to
how data will be accessed
\item e.g. store related information on the same nearby cylinders
\end{itemize}
\item[{Nonvolatile write buffers}] \begin{itemize}
\item speed up disk writes by writing blocks to a non-volatile RAM buffer
immediately
\item controller then writes to disk whenever the disk has no other requests
or request has been pending for some time
\end{itemize}
\item[{Log disk}] \begin{itemize}
\item a disk devoted to writing a sequential log of block updates
\item used like nonvolatile RAM
\end{itemize}
\end{description}
\subsubsection{flash storage}
\label{sec-14-2-4}
\begin{description}
\item[{NAND flash}] \begin{itemize}
\item requires page-at-a-time read
\item ssd (solid state disks) use multiple flash storage
\item erase is slow
\end{itemize}
\end{description}
\subsection{RAID(Redundant arrays of independent disks)}
\label{sec-14-3}
\begin{itemize}
\item high capacity and high speed by using multiple disks in parallel.
high reliability by storing data redundantly
\item[{redundancy}] \begin{itemize}
\item store extra information that can be used to rebuild information
lost in a disk failure
\item E.g. \textbf{Mirroring}
\end{itemize}
\item Mean time to failure
\end{itemize}
\subsubsection{improvement in performance via parallelism}
\label{sec-14-3-1}
\begin{itemize}
\item two main goals of parallelism in a disk system
\begin{itemize}
\item load balance multiple small accesses to increase throughput
\item parallelize large accesses to reduce response time
\end{itemize}
\item[{bit-level striping}] split the bits of each byte across multiple disks
\item[{block-level striping}] with n disks, block i goes to disk (i mod n) + 1
\end{itemize}
\subsubsection{Raid level}
\label{sec-14-3-2}
\subsection{File organization}
\label{sec-14-4}
\subsubsection{fixed-length records}
\label{sec-14-4-1}
\begin{itemize}
\item store record i starting from byte n * (i - 1), where n is the size of each record
\item deletion
\begin{itemize}
\item free list
store the address of the first deleted record in the file header
\end{itemize}
\end{itemize}
\subsubsection{varaible-length record}
\label{sec-14-4-2}
\begin{itemize}
\item arise in several ways
\begin{itemize}
\item storage of multiple record types in a file
\item record types that allow variable lengths for one or more fields such as strings
\item record types that allow repeating fields
\end{itemize}
\item variable length attributes represented by fixed szie, with actual data stored after
all fixed length attributes
\item null values represented by null-value bitmap
\item[{slotted page structure}] \begin{itemize}
\item contains
number of record entries
end of free space in the block
location and size of each record
\item records can be moved around within a page to keep them contiguous with no empty space
between them
\item pointers shouldn't point directly to record--instead they should point to the entry
for the record in header
\end{itemize}
\end{itemize}
\subsubsection{organization of records in files}
\label{sec-14-4-3}
\begin{itemize}
\item sequential file organization
\item multitable clustering file organization
\end{itemize}
\subsection{data dictionary storage}
\label{sec-14-5}
\begin{itemize}
\item data dictionary stores \textbf{metadata}
\item information about relations
\item user and accouting information
\item statistical and descriptive data
\item physical file organization
\end{itemize}
\section{{\bfseries\sffamily TODO} }
\label{sec-15}
10.8 10.14 10.17
\section{Chap 11}
\label{sec-16}
\subsection{Basic concepts}
\label{sec-16-1}
\begin{description}
\item[{index file}] \begin{itemize}
\item consist of records of the form
\begin{center}
\begin{tabular}{ll}
search-key & pointer\\
\end{tabular}
\end{center}
\item two kinds of indices
\begin{itemize}
\item ordered indices
\begin{itemize}
\item primary index
\begin{itemize}
\item the index whose search key specifies the sequential order of the file
\end{itemize}
\item secondary index
\begin{itemize}
\item the index whose search key specifies the sequential order of the file
\end{itemize}
\end{itemize}
\item hash indices
\end{itemize}
\item index evaluation metrics
\begin{itemize}
\item access types
\item access time
\item insertion time
\item deletion time
\item space overhead
\end{itemize}
\end{itemize}
\end{description}
