databaseconcept.org
** Ordered indices
   + index entities are stored sorted on the search key value
   + primary index(clustering index)主索引 ::
     + not primary key
     + the index whose search key specifies the sequential order of the file
   + secondary index(non-clustring index) ::
     + an index whose search key specifies an order different from
       the sequential order of the file
     + e.g.
   + dense index ::
     + index record appears for every search-key value
   + sparse index files ::
     + contains index records for only some search-key
     + compared to dense indices
       + less space and less maintenance
       + generally slower than dense index
     + good tradeoff
       + sparse index with an index entry for every block in file, corresponding
         to least search-key value in the block
   + multilevel index ::
** B+-tree index files
** B+-tree file organization
   + leaf nodes store records
** Bulk loading and bottom-up build
   + problem
     inserting entries one-at-a-time into a B+-tree requires >= 1 IO per entry
   + efficient alternative 1
     sort entries first
   + efficient alternative 2: bottom-up B+-tree construction
     starting with leaf level
** Multiple-key access
   +
#+BEGIN_SRC sql
  select ID
  from instructor
  where dept_name = "Finance" and salary = 80000
#+END_SRC
* DONE
  CLOSED: [2018-05-21 一 13:15]
  :LOGBOOK:
  - State "DONE"       from "TODO"       [2018-05-21 一 13:15]
  :END:
11.3a 11.4
* chap12
** Measure of query cost
   + factors ::
     + disk accesses
     + CPU
     + number of seeks
     + number of blocks read
     + number of blocks written
   + $t_T$ time to transfer one block
     $t_S$ time for one seek
   + use worst case estimates
** selectoin operation
*** file scan
    + A1 (linear search) ::
      + cost = $b_r$ block transfers + 1 seek
        $b_r$ denotes number of blocks containing records from relation r
*** index scan
    + A2 (primary index, equality on key) ::
      + retrieve a single record taht satisfy the corresponding equality condition
      + cost = $(h_i+1)*(t_T+t_s)$
    + A3 (primary index, equality on nonkey) ::
    + A4 (secondary index, equality on nonkey) ::
      + retrieve a single record if the search-key is a candidate key
      + cost = $(h_i+1)*(t_T+t_S)$
      + retrieve multiple records if search-key is not a candidate key
*** selection involving comparisons
    + can implement selections of the form $\sigma_{A\le V}(r)$ or $\sigma_{A\ge V}(r)$
    + A5 (primary index, comparison) ::
      + relation sorted on A
    + A6 (secondary index
*** implementation of complex selections
    + conjunction $\sigma_{\theta_1}\cap\dots\sigma_{\theta_n}(r)$
    + A7 (conjunctive selection using one index) ::
      + select a combination of $\theta_i$ and algorithms A1 through A7 that
        results in the least cost for $\sigma_{\theta_i}(r)$
    + A8 (conjunctive sleelction using composite index) ::
    + A9 (conjunctive selection by intersection of identifiers) ::
** external sort-merge
** Join
*** nested-loop join
    + $r\bowtie_{\theta} s$
    + worst
      $n_r\times b_s + b_r$
*** block nested-loop join
*** indexed nested-loop join
    + for each tuple in the outer relation $r$, a lookup is performed on the index
      for $s$, and the relevant tuples are retrieved.
    + in the worst case, $b_r$ I/O operations are needed to read relation $r$
      $b_r(t_T+t_S)+n_r\times c$
*** merge join
    + w
      1. sort both relations on their join attribute
      2. merge the sorted relations
*** hash join
** evaluation of expression
*** materialization
    + evaluate one operation at a time, starting at the lowest-level. Use intermediate
      results materialized into temporary relations to evaluate next-level operations
    + double buffering ::
         + use two output buffers for each operation, when one is ful
*** pipeline
    + evaluate several operations simultaneously, passing the results of one operation
      on to the next
* TODO
  12.2 12.3b
* chap13
** overview
   + evalutaion plan :: defines exactly what algorithm is used for each operation and
        how the execution of the operations is coordinate.
   + cost-based query optimization ::
     + generate logically equivalent expressions using *equivalence rules*
     + annotate resultant expressions to get alternative query plans
     + choose the cheapest plan based on *estimated cost*
** transformation
   + equivalent rules ::
     1. conjunctive selection operations
        $\sigma_{\theta_1\cap\theta_2}(E)=\sigma_{\theta_1}(\sigma_{\theta_2}(E))$
     2. commutative
        $\sigma_{\theta_1}(\sigma_{\theta_2}(E))=\sigma_{\theta_2}(\sigma_{\theta_1}(E))$
     3. only the last in a sequence of projection operations is needed
        $\prod_{L_1}(\prod_{L_2}(\dots(\prod_{L_n}(E))\dots))=\prod_{L_1}(E)$
     4. $\sigma_\theta(E_1\times E_2)=E_1\bowtie_\theta E_2$
        $\sigma_{\theta_1}(E_1\bowtie_{\theta_2} E_2)=E_1\bowtie_{\theta_1\wedge\theta_2} E_2$
     5. theta-join operations are commutative
     6. associative
     7. the selection operation distributes over the theta-join operation under the following
        two conditions
        $\sigma_{\theta_0}(E_1\bowtie_\theta E_2)=(\sigma_{\theta_0}(E_1))\bowtie_\theta E_2$
        $\sigma_{\theta_1\wedge\theta_2}(E_1\bowtie_\theta E_2)=(\sigma_{\theta_1}(E_1))\bowtie_\theta(\sigma_{\theta_2}(E_2))$
     8. $\prod_{L_1\cup L_2}(E_1\bowtie_\theta E_2)=(\prod_{L_1}(E_1))\bowtie_\theta(\prod_{L_2}(E_2))$
        + let $L_3$ are attributes of $E_1$ that are involved in join condition $\theta$
          $\prod_{L_1\cup L_2}(E_1\bowtie_\theta E_2)=\prod_{L_1\cup L_2}((\prod_{L_1\cup L_3(E_1)}))
          \bowtie_\theta(\prod_{L_2\cup L_4}(E_2))$
     9. $\sigma_P(E_1-E_2)=\sigma_P(E_1)-\sigma_P(E_2)$
   + enumeration of equivalent
** statistics for cost estimation
   + $n_r$, the number of tuples in the relation $r$
     $b_r$, number of blocks containing tuples of relation $r$
     $l_r$, size of a tuple of relation $r$ in bytes
     $f_r$, the blocking factor of ralation $r$ (the number of tuples of $r$ that fit into
     one block)
     $V(A,r)$, the number of distinct values that appear in the relation $r$ for attribute
     $A$.
   + $b_r=\lceil\frac{n_r}{f_r}\rceil$
   + selectivity ::
     + probability that a tuple in the relation $r$ satisfies $\theta_i$
     + If $s_i$ is the number of satisfying tuples in $r$, the selectivity of $\theta_i$
   + join size estimation ::
* TODO
  13.4 13.15
