databaseconcept.tex
\subsection{Ordered indices}
\label{sec-16-2}
\begin{itemize}
\item index entities are stored sorted on the search key value
\item[{primary index(clustering index)主索引}] \begin{itemize}
\item not primary key
\item the index whose search key specifies the sequential order of the file
\end{itemize}
\item[{secondary index(non-clustring index)}] \begin{itemize}
\item an index whose search key specifies an order different from
the sequential order of the file
\item e.g.
\end{itemize}
\item[{dense index}] \begin{itemize}
\item index record appears for every search-key value
\end{itemize}
\item[{sparse index files}] \begin{itemize}
\item contains index records for only some search-key
\item compared to dense indices
\begin{itemize}
\item less space and less maintenance
\item generally slower than dense index
\end{itemize}
\item good tradeoff
\begin{itemize}
\item sparse index with an index entry for every block in file, corresponding
to least search-key value in the block
\end{itemize}
\end{itemize}
\item[{multilevel index}] 
\end{itemize}
\subsection{B+-tree index files}
\label{sec-16-3}
\subsection{B+-tree file organization}
\label{sec-16-4}
\begin{itemize}
\item leaf nodes store records
\end{itemize}
\subsection{Bulk loading and bottom-up build}
\label{sec-16-5}
\begin{itemize}
\item problem
inserting entries one-at-a-time into a B+-tree requires >= 1 IO per entry
\item efficient alternative 1
sort entries first
\item efficient alternative 2: bottom-up B+-tree construction
starting with leaf level
\end{itemize}
\subsection{Multiple-key access}
\label{sec-16-6}
\begin{itemize}
\item 
\end{itemize}
\lstset{language=SQL,label= ,caption= ,numbers=none}
\begin{lstlisting}
select ID
from instructor
where dept_name = "Finance" and salary = 80000
\end{lstlisting}
\section{{\bfseries\sffamily DONE} }
\label{sec-17}
11.3a 11.4
\section{chap12}
\label{sec-18}
\subsection{Measure of query cost}
\label{sec-18-1}
\begin{description}
\item[{factors}] \begin{itemize}
\item disk accesses
\item CPU
\item number of seeks
\item number of blocks read
\item number of blocks written
\end{itemize}
\item $t_T$ time to transfer one block
$t_S$ time for one seek
\item use worst case estimates
\end{description}
\subsection{selectoin operation}
\label{sec-18-2}
\subsubsection{file scan}
\label{sec-18-2-1}
\begin{description}
\item[{A1 (linear search)}] \begin{itemize}
\item cost = $b_r$ block transfers + 1 seek
$b_r$ denotes number of blocks containing records from relation r
\end{itemize}
\end{description}
\subsubsection{index scan}
\label{sec-18-2-2}
\begin{description}
\item[{A2 (primary index, equality on key)}] \begin{itemize}
\item retrieve a single record taht satisfy the corresponding equality condition
\item cost = $(h_i+1)*(t_T+t_s)$
\end{itemize}
\item[{A3 (primary index, equality on nonkey)}] 
\item[{A4 (secondary index, equality on nonkey)}] \begin{itemize}
\item retrieve a single record if the search-key is a candidate key
\item cost = $(h_i+1)*(t_T+t_S)$
\item retrieve multiple records if search-key is not a candidate key
\end{itemize}
\end{description}
\subsubsection{selection involving comparisons}
\label{sec-18-2-3}
\begin{itemize}
\item can implement selections of the form $\sigma_{A\le V}(r)$ or $\sigma_{A\ge V}(r)$
\item[{A5 (primary index, comparison)}] \begin{itemize}
\item relation sorted on A
\end{itemize}
\item A6 (secondary index
\end{itemize}
\subsubsection{implementation of complex selections}
\label{sec-18-2-4}
\begin{itemize}
\item conjunction $\sigma_{\theta_1}\cap\dots\sigma_{\theta_n}(r)$
\item[{A7 (conjunctive selection using one index)}] \begin{itemize}
\item select a combination of $\theta_i$ and algorithms A1 through A7 that
results in the least cost for $\sigma_{\theta_i}(r)$
\end{itemize}
\item[{A8 (conjunctive sleelction using composite index)}] 
\item[{A9 (conjunctive selection by intersection of identifiers)}] 
\end{itemize}
\subsection{external sort-merge}
\label{sec-18-3}
\subsection{Join}
\label{sec-18-4}
\subsubsection{nested-loop join}
\label{sec-18-4-1}
\begin{itemize}
\item $r\bowtie_{\theta} s$
\item worst
$n_r\times b_s + b_r$
\end{itemize}
\subsubsection{block nested-loop join}
\label{sec-18-4-2}
\subsubsection{indexed nested-loop join}
\label{sec-18-4-3}
\begin{itemize}
\item for each tuple in the outer relation $r$, a lookup is performed on the index
for $s$, and the relevant tuples are retrieved.
\item in the worst case, $b_r$ I/O operations are needed to read relation $r$
      $b_r(t_T+t_S)+n_r\times c$
\end{itemize}
\subsubsection{merge join}
\label{sec-18-4-4}
\begin{itemize}
\item w
\begin{enumerate}
\item sort both relations on their join attribute
\item merge the sorted relations
\end{enumerate}
\end{itemize}
\subsubsection{hash join}
\label{sec-18-4-5}
\subsection{evaluation of expression}
\label{sec-18-5}
\subsubsection{materialization}
\label{sec-18-5-1}
\begin{itemize}
\item evaluate one operation at a time, starting at the lowest-level. Use intermediate
results materialized into temporary relations to evaluate next-level operations
\item[{double buffering}] \begin{itemize}
\item use two output buffers for each operation, when one is ful
\end{itemize}
\end{itemize}
\subsubsection{pipeline}
\label{sec-18-5-2}
\begin{itemize}
\item evaluate several operations simultaneously, passing the results of one operation
on to the next
\end{itemize}
\section{{\bfseries\sffamily TODO} }
\label{sec-19}
12.2 12.3b
\section{chap13}
\label{sec-20}
\subsection{overview}
\label{sec-20-1}
\begin{description}
\item[{evalutaion plan}] defines exactly what algorithm is used for each operation and
how the execution of the operations is coordinate.
\item[{cost-based query optimization}] \begin{itemize}
\item generate logically equivalent expressions using \textbf{equivalence rules}
\item annotate resultant expressions to get alternative query plans
\item choose the cheapest plan based on \textbf{estimated cost}
\end{itemize}
\end{description}
\subsection{transformation}
\label{sec-20-2}
\begin{description}
\item[{equivalent rules}] \begin{enumerate}
\item conjunctive selection operations
$\sigma_{\theta_1\cap\theta_2}(E)=\sigma_{\theta_1}(\sigma_{\theta_2}(E))$
\item commutative
$\sigma_{\theta_1}(\sigma_{\theta_2}(E))=\sigma_{\theta_2}(\sigma_{\theta_1}(E))$
\item only the last in a sequence of projection operations is needed
$\prod_{L_1}(\prod_{L_2}(\dots(\prod_{L_n}(E))\dots))=\prod_{L_1}(E)$
\item $\sigma_\theta(E_1\times E_2)=E_1\bowtie_\theta E_2$
        $\sigma_{\theta_1}(E_1\bowtie_{\theta_2} E_2)=E_1\bowtie_{\theta_1\wedge\theta_2} E_2$
\item theta-join operations are commutative
\item associative
\item the selection operation distributes over the theta-join operation under the following
two conditions
$\sigma_{\theta_0}(E_1\bowtie_\theta E_2)=(\sigma_{\theta_0}(E_1))\bowtie_\theta E_2$
$\sigma_{\theta_1\wedge\theta_2}(E_1\bowtie_\theta E_2)=(\sigma_{\theta_1}(E_1))\bowtie_\theta(\sigma_{\theta_2}(E_2))$
\item $\prod_{L_1\cup L_2}(E_1\bowtie_\theta E_2)=(\prod_{L_1}(E_1))\bowtie_\theta(\prod_{L_2}(E_2))$
\begin{itemize}
\item let $L_3$ are attributes of $E_1$ that are involved in join condition $\theta$
          $\prod_{L_1\cup L_2}(E_1\bowtie_\theta E_2)=\prod_{L_1\cup L_2}((\prod_{L_1\cup L_3(E_1)}))
          \bowtie_\theta(\prod_{L_2\cup L_4}(E_2))$
\end{itemize}
\item $\sigma_P(E_1-E_2)=\sigma_P(E_1)-\sigma_P(E_2)$
\end{enumerate}
\end{description}
% Emacs 25.3.50.2 (Org mode 8.2.10)
\end{document}